In [20]:
import pandas as pd

In [22]:
data = pd.read_excel("financial_loan_data.xlsx")

In [23]:
data.head()

,id,address_state,application_type,emp_length,emp_title,grade,home_ownership,issue_date,last_credit_pull_date,last_payment_date,...,sub_grade,term,verification_status,annual_income,dti,installment,int_rate,loan_amount,total_acc,total_payment
0,1077430,GA,INDIVIDUAL,< 1 year,Ryder,C,RENT,2021-02-11,2021-09-13,2021-04-13,...,C4,60 months,Source Verified,30000.0,0.0100,59.83,0.1527,2500,4,1009
1,1072053,CA,INDIVIDUAL,9 years,MKC Accounting,E,RENT,2021-01-01,2021-12-14,2021-01-15,...,E1,36 months,Source Verified,48000.0,0.0535,109.43,0.1864,3000,4,3939
2,1069243,CA,INDIVIDUAL,4 years,Chemat Technology Inc,C,RENT,2021-01-05,2021-12-12,2021-01-09,...,C5,36 months,Not Verified,50000.0,0.2088,421.65,0.1596,12000,11,3522
3,1041756,TX,INDIVIDUAL,< 1 year,barnes distribution,B,MORTGAGE,2021-02-25,2021-12-12,2021-03-12,...,B2,60 months,Source Verified,42000.0,0.0540,97.06,0.1065,4500,9,4911
4,1068350,IL,INDIVIDUAL,10+ years,J&J Steel Inc,A,MORTGAGE,2021-01-01,2021-12-14,2021-01-15,...,A1,36 months,Verified,83000.0,0.0231,106.53,0.0603,3500,28,3835

In [24]:
data.columns

Index(['id', 'address_state', 'application_type', 'emp_length', 'emp_title',
       'grade', 'home_ownership', 'issue_date', 'last_credit_pull_date',
       'last_payment_date', 'loan_status', 'next_payment_date', 'member_id',
       'purpose', 'sub_grade', 'term', 'verification_status', 'annual_income',
       'dti', 'installment', 'int_rate', 'loan_amount', 'total_acc',
       'total_payment'],
      dtype='object')

In [25]:
data['address_state'].unique()

array(['GA', 'CA', 'TX', 'IL', 'PA', 'FL', 'MI', 'RI', 'NY', 'MD', 'WI',
       'NV', 'UT', 'WA', 'NH', 'HI', 'MA', 'OK', 'NJ', 'OH', 'AZ', 'CT',
       'MN', 'CO', 'TN', 'VA', 'MO', 'DE', 'NM', 'LA', 'AR', 'KY', 'NC',
       'SC', 'WV', 'KS', 'WY', 'OR', 'AL', 'VT', 'MS', 'DC', 'MT', 'SD',
       'AK', 'IN', 'ME', 'ID', 'NE', 'IA'], dtype=object)

In [26]:
data['application_type'].unique()

array(['INDIVIDUAL'], dtype=object)

In [27]:
data['emp_length'].unique()

array(['< 1 year', '9 years', '4 years', '10+ years', '3 years',
       '5 years', '1 year', '6 years', '2 years', '7 years', '8 years'],
      dtype=object)

In [28]:
data['emp_title'].unique()

array(['Ryder', 'MKC Accounting', 'Chemat Technology Inc', ...,
       'Anaheim Regional Medical Center', 'Brooklyn Radiology',
       'Allen Edmonds'], dtype=object)

In [36]:
data['grade'].unique()

array(['C', 'E', 'B', 'A', 'D', 'F', 'G'], dtype=object)

In [50]:
data['home_ownership'].unique()

array(['RENT', 'MORTGAGE', 'OWN', 'OTHER', 'NONE'], dtype=object)

In [52]:
data['sub_grade'].unique()

array(['C4', 'E1', 'C5', 'B2', 'A1', 'C3', 'C2', 'A4', 'A5', 'B5', 'B4',
       'B3', 'B1', 'D1', 'A2', 'A3', 'D4', 'D2', 'C1', 'D3', 'E3', 'F1',
       'E2', 'E5', 'D5', 'E4', 'F2', 'G3', 'F3', 'G1', 'F4', 'G4', 'G2',
       'F5', 'G5'], dtype=object)

In [88]:
data['term'].unique()

array(['60 months', '36 months'], dtype=object)

In [86]:
data['term']=data['term'].str.strip()

In [66]:
data['verification_status'].unique()

array(['Source Verified', 'Not Verified', 'Verified'], dtype=object)

In [ ]:
# Analysis Questions?
# --------------------------
# 1. Find total loan issued by each address. 
# 2. Find total loan issued by purpose and grade. 
# 3. Find average loan taken according to home_ownership. 
# 4. Find total issued loan by day and month. (multiple group by, sum)
# 5. Find total number of loan verified. (only show verified details)
#    -> groupby -> conditional filtering
# 6. Find average annual income by purpose.

In [46]:
loan_address = data.groupby('address_state')['id'].count().sort_values(ascending=False).reset_index()

In [48]:
loan_address

   address_state    id
0             CA  6894
1             NY  3701
2             FL  2773
3             TX  2664
4             NJ  1822
5             IL  1486
6             PA  1482
7             VA  1375
8             GA  1355
9             MA  1310
10            OH  1188
11            MD  1027
12            AZ   833
13            WA   805
14            CO   770
15            NC   759
16            CT   730
17            MI   685
18            MO   660
19            MN   592
20            NV   482
21            SC   464
22            WI   446
23            OR   436
24            AL   432
25            LA   426
26            KY   320
27            OK   293
28            KS   260
29            UT   252
30            AR   236
31            DC   214
32            RI   196
33            NM   183
34            HI   170
35            WV   167
36            NH   161
37            DE   110
38            MT    79
39            WY    79
40            AK    78
41            SD    63
42            VT    54
43            MS    19
44            TN    17
45            IN     9
46            ID     6
47            NE     5
48            IA     5
49            ME     3

In [58]:
filter_loanaddress = loan_address['id']>2000

In [64]:
loan_address[filter_loanaddress]

  address_state    id
0            CA  6894
1            NY  3701
2            FL  2773
3            TX  2664

In [72]:
# 2. Find total loan issued by purpose and grade. 
loan_grade_purpose = data.groupby(['purpose','grade'])['id'].count().sort_values().reset_index()

In [74]:
loan_grade_purpose

               purpose grade    id
0             vacation     G     1
1          educational     G     1
2             vacation     F     2
3     renewable_energy     G     2
4                  car     G     2
..                 ...   ...   ...
93         credit card     B  1603
94  Debt consolidation     D  2771
95  Debt consolidation     A  3753
96  Debt consolidation     C  3868
97  Debt consolidation     B  5504

[98 rows x 3 columns]

In [80]:
#Find average loan taken according to home_ownership
loan_home = data.groupby('home_ownership')['id'].count().sort_values(ascending=False).reset_index()

In [82]:
loan_home

  home_ownership     id
0           RENT  18439
1       MORTGAGE  17198
2            OWN   2838
3          OTHER     98
4           NONE      3

In [122]:
#Find total issued loan by day and month. (multiple group by, sum)
data['Issued_Month']=pd.to_datetime(data['issue_date']).dt.month_name()
data['Issued_Day']=pd.to_datetime(data['issue_date']).dt.day

In [124]:
data.head()

,id,address_state,application_type,emp_length,emp_title,grade,home_ownership,issue_date,last_credit_pull_date,last_payment_date,...,annual_income,dti,installment,int_rate,loan_amount,total_acc,total_payment,Month,Issued_Month,Issued_Day
0,1077430,GA,INDIVIDUAL,< 1 year,Ryder,C,RENT,2021-02-11,2021-09-13,2021-04-13,...,30000.0,0.0100,59.83,0.1527,2500,4,1009,2,February,11
1,1072053,CA,INDIVIDUAL,9 years,MKC Accounting,E,RENT,2021-01-01,2021-12-14,2021-01-15,...,48000.0,0.0535,109.43,0.1864,3000,4,3939,1,January,1
2,1069243,CA,INDIVIDUAL,4 years,Chemat Technology Inc,C,RENT,2021-01-05,2021-12-12,2021-01-09,...,50000.0,0.2088,421.65,0.1596,12000,11,3522,1,January,5
3,1041756,TX,INDIVIDUAL,< 1 year,barnes distribution,B,MORTGAGE,2021-02-25,2021-12-12,2021-03-12,...,42000.0,0.0540,97.06,0.1065,4500,9,4911,2,February,25
4,1068350,IL,INDIVIDUAL,10+ years,J&J Steel Inc,A,MORTGAGE,2021-01-01,2021-12-14,2021-01-15,...,83000.0,0.0231,106.53,0.0603,3500,28,3835,1,January,1

In [126]:
loan_day_month = data.groupby(['Issued_Month','Issued_Day'])['id'].count().reset_index()

In [128]:
loan_day_month

   Issued_Month  Issued_Day    id
0         April           8   155
1         April           9   289
2         April          10   805
3         April          11  1506
4        August           7    33
..          ...         ...   ...
60    September           7    18
61    September           8    32
62    September           9   447
63    September          10  1058
64    September          11  1980

[65 rows x 3 columns]

In [114]:
# Find total number of loan verified. (only show verified details)
#    -> groupby -> conditional filtering
Total_loan = data.groupby('verification_status')['id'].count().reset_index()

In [116]:
Total_loan

  verification_status     id
0        Not Verified  16464
1     Source Verified   9777
2            Verified  12335

In [136]:
verified = (Total_loan['verification_status']=='Source Verified') & (Total_loan['verification_status']=='Verified')
Total_loan[verified]

Empty DataFrame
Columns: [verification_status, id]
Index: []